1
1_10
1_2
1_2_from
1_out
10
10_10
10_but
10_out
10_out_10
2
2_10
2_out
2_out_10
2006
3
3_10
3_out_10
4
4_10
4_out_10
45
5
6
60
7
7_10
7_out
7_out_10
8
8_10
8_out
80_s
9
9_10
9_out_10
90_minutes
able_to
able_to_see
about
above
absolutely
absolutely_no
absorbing
absurd
accent
according
across
act
acted
acting
acting_great
action
actor
actor_in
actors
actors_but
actress
actually
adds
adventure
affair
after
again
against
age
ages
air
all_but
all_can
all_in
all_in_all
all_time
all_together
all_would
almost
along
already
alright
also
although
always
am
am_not
amateurish
amazing
amazing_that
america
american
americans
among
amounts
amusing
animal
animated
animation
annoying
another
another_good
any
any_characters
any_them
anyone
anyone_interested
anyone_who
anything
anyway
apartment
ape
appalling
apparently
appeal
appear
appeared_to
appears
appears_to
appreciate
appreciated
area
around
art
as_all
as_comedy
as_far_as
as_good
as_good_as
as_if
as_long
as_movie
as_much
as_much_as
as_to
as_well
as_well_as
ashamed
asleep
at_all
at_best
at_end
at_first
at_least
at_same
at_same_time
at_time
at_times
atmosphere
atrocious
attempt
attempt_at
attention
audience
author
available
available_to
average
avoid
awake
award
away
awesome
awful
b
b_movie
back
back_enjoy
back_in
back_to_life
bad
bad_about
bad_at_all
bad_guys
bad_movie
bad_movies
bad_reviews
bad_thing
badly
baldwin
barbara_stanwyck
barely
based
based_on_real
based_on_true_story
basically
basketball
be_comedy
be_disappointed
be_entertaining
be_funny
be_good
be_great
be_missed
be_seen
be_very
beat
beautiful
beautifully
beauty
became
because
become
becomes
been
been_great
before
beginning
beginning_to
begins_with
being
bela_lugosi
believable
believe
below
below_average
best
best_all
best_film
best_part
best_thing_about
better
better_job
better_than
between
biblical
big
big_screen
bin
bit
black
black_white
blah
blame
bland
blatant
blew_away
blood
blown_up
blue
body
boll
bomb
bond
book
bore
bored
boredom
boring
boring_but
both
bother
bothered_to
bottom
boy
boys
brain
bravo
brazil
brilliant
brilliantly
british
bronson
brothers
brought
brutal
budget
bugs
bunch
bush
but_also
but_can
but_did
but_don_t
but_if
but_in
but_just
but_liked
but_not
but_not_much
but_s
but_sadly
but_still
but_that
but_then
by
by_time
c
called
came
came_to
camera
can
can_be
can_get
can_honestly_say
can_relate
can_see
can_t
can_t_wait
can_watch
cannibal
captain
captures
cardboard
care
career
careful
case
cash_in
cast
cat
catch
caught
cerebral
certainly
chance
change
channel
character
characters
characters_well
charming
chase
cheap
cheaply
check
check_out
cheesy
chick
chief
child
children
chilling
choice
christian
christians
christopher_lee
church
cinema
cinematography
city
classic
claus
cliché
cliched
clichéd
close_to
cold
college
come
come_on
comedies
comedy
comes
comic
coming
compare
compared
compelling
complaint
complete
completely
complex
concept
confusing
connect
consequences
contains
content
continuity
copy
could
could_be
could_been
couldn
country
couple
couple_hours
courage
course
cover
covers
crafted
crap
crappy
crazy
credibility
credit
creepy
crew
cried
crime
criminal
cry
cult
current
cut
cute
d
damme
dance
dark
daughter
david
day
days
dead
deal
deal_with
deals_with
dear
death
decent
decides
decides_to
deeper
definitely
definitely_not
definitely_recommend
definitely_worth
delicious
deliciously
delightful
delightfully
deliver
delivering
delivers
deserves
desperately
despite
detract
developed
dialog
dialogue
diane
did
did_not
didn_t
different
difficult_to
dimensional
dire
direct_to_video
direction
director
directors
dirty_harry
disappoint
disappointed
disappointing
disappointment
disaster
disgrace
disgusting
dismiss
disney
distasteful
do
do_not
documentary
does
does_great
does_not
doesn_t
doesn_t_help
doesn_t_make
doesn_t_work
doing
dollar
don
don_t
don_t_know
don_t_like
don_t_miss
don_t_take
don_t_think
don_t_want_to
done
douglas
down
down_hill
downhill
dozen
dr
drags
drama
drawn_into
dreadful
dreams
dreck
drew
drivel
driving
dull
dumb
dumber
during
dvd
each
earlier
early
easily
easy
eaten
ed_wood
edge
edge_seat
edited
editing
eerie
effective
effects
effort
eisenstein
either
elements
else
elsewhere
email
embarrassed
embarrassing
embarrassingly
embarrassment
emotions
end
end_there
ending
endless
ends
english
enjoy
enjoyable
enjoyed
enough
enough_to
entertaining
entertaining_but
entertainment
entertains
entire
entirely
epic
episode
episodes
era
especially
essential
etc
europe
even
even_better
even_close_to
even_if
even_though
even_worse_than
ever
ever_seen
every
every_day
everybody
everyday
everyone
everyone_else
everything
evil
example
excellent
excellent_film
excellently
except
exception
exceptional
exciting
excuse
existent
expect
expected
expecting
experience
extraordinary
extremely
eyes
fabulous
facing
fact
fact_that
facts
failed
fails
failure
fake
falls
familiar
family
famous
fan
fans
fantastic
fantasy
far
far_between
far_too
farmer
fascinating
fast_forward
fast_paced
father
favorite
favorite_movies
favorites
favourite
fears
feature
feeble
feel
feeling
feelings
fell_asleep
fell_in
felt
felt_like
female
few
few_laughs
few_years_later
fight
film_as
film_but
film_excellent
film_in
film_just
film_s
film_that
filmmakers
films
final
finally
find
fine
fine_film
finest
first
first_movie
first_rate
first_saw
first_time
first_two
five
flat
flawless
flaws
flick
flimsy
flying
follows
footage
forced
forget
forgettable
form
fought
found
four
franchise
frank
freedom
french
fresh
friend
friends
friendship
from
from_being
from_start_to_finish
full
fun
fun_film
funniest
funny
funny_film
funny_in
future
game
gang
garbage
gave
gave_2
gave_up
gay
gem
generally
generous
genius
genre
gently
get
get_bored
get_copy
gets
getting
ghost
girl
girls
give
give_1
give_4
give_7
given
gives
glad
glad_did
glorious
go
god
goes
going
going_to
good
good_as
good_but
good_film
good_job
good_movie
good_show
good_time
good_to
gore
got
got_to_see
gothic
government
grade
grade_b
grade_d
great
great_as
great_but
great_film
great_job
great_movie
great_show
greatest
grieving
gritty
guess
gun
guy
guy_who
guys
hackman
hackneyed
had
had_high
had_to
hair
half
half_hearted
hand
happened
happy
hard
hard_to
hartley
hated
haunting
having
head
heard
heart
hell
help
helps
henry
here
hero
high
highly
highly_recommend
highly_recommended
hilarious
history
hit
holds
hollow
hollywood
home
honestly
hong_kong
hooked
hope
hoping
horrible
horrid
horror
horror_film
horror_flick
hour
hours
hours_life
house
how
how_bad
how_good
how_not
how_not_to
however
huge
human
humor
humorous
humour
husband
hype
idea
ideal
idiotic
if
if_can
if_director
if_don_t
if_don_t_like
if_had
if_like
if_must
if_not
if_re
if_want
if_want_to
if_want_to_see
ignore
ill
images
important
impossible
impressed
in_all
in_cast
in_city
in_fact
in_film
in_final
in_first
in_front
in_grave
in_lives
in_mind
in_movie
in_order_to
in_post
in_real
in_real_life
in_that
in_top
in_way
inaccurate
inappropriate
including
incoherent
incomprehensible
incredible
incredibly
inept
inside
instead
instead_1
insult
insult_to
insulting
intelligent
intended
intense
interest
interesting
interesting_but
into
involved
irritating
isn
isn_t_much
isn_t_very
itself
jack
jackass
jacques
james_stewart
jamie
jean
job
john
joke
jones
journey
joy_to
junk
just
just_as
just_because
just_did
just_didn
just_doesn
just_enjoy
just_great
just_isn_t
just_not
just_right
just_seems
just_to
just_too
just_wasn_t
justin
keep
keeps
kennedy
kids
kill
killed
killer
killing
kind
kitty
know
know_what
knowing
known
knows
lack
lacked
lacking
lacks
lame
lance
language
last
last_scene
late
later
latter
laugh
laughable
laughing
laughs
law
lead
leading
leads
least
leave
leaves
led
left
less
less_than
let
let_down
let_s
let_s_see
letdown
life
lifeless
light
likable
like
like_in
like_watching
liked
liked_movie
line
liners
lines
little
little_film
little_more
little_slow
little_to
live
lives
living
ll
lonely
long
long_time
look
look_at
look_elsewhere
look_like
looked
looked_like
looking
looking_forward
looks
looks_at
looks_like
loss
lost
lost_in
lost_interest
lot
lot_about
lot_fun
lot_things
lots
lousy
love
love_movie
love_to
loved
loved_movie
lovely
loving
low
low_budget
low_key
ludicrous
lugosi
m
m_afraid
m_not
machine
made
made_movie
made_tv
magic
magnificent
main
main_character
make
make_fun
make_movie
makers
makes
makeup
making
male
man
man_who
manages_to
manipulative
many
many_people
married
marvelous
mason
master
masterful
masterpiece
match
material
matter
matthau
may
may_be
may_not
may_not_be
may_seem
maybe
mcdowell
mean
meaning
meant
mediocre
meets
memorable
men
mention
mesmerizing
mess
mess_with
message
michael
michael_jackson
midget
might
might_been
might_enjoy
might_not
mildly
mind
minute_movie
minutes
miscast
miserably
miss
missing
mistake
moment
moments
money
money_back
monster
more
more_enjoyable
more_entertaining
more_like
more_movies
more_than
moronic
most
most_people
mother
motions
mouth
move
moved
moves
movie_but
movie_great
movie_just
movie_only
movie_s
movie_that
movie_will
movie_with
movies
movies_always
movies_do
moving
mr
ms
mst3k
much
much_as
much_better
much_better_than
muddled
multi
mummy
murder
music
musical
must
must_see
must_watch
mystery_science
n
name
nature
near
neatly
necessary
need
needed
needs
neither
never
never_get
nevertheless
new
new_york
next
nice
nicely
night
nightmare
no
no_chemistry
no_idea
no_matter
no_other
no_real
no_sense
no_story
no_where
noir
none
none_less
nonetheless
nonsense
norris
not_bad
not_be
not_believable
not_disappointed
not_enough
not_even
not_funny
not_good
not_in_good
not_just
not_make
not_much
not_only
not_recommend
not_recommended
not_that
not_them
not_to
not_typical
not_very
not_very_good
not_worth
nothing
nothing_in
nothing_more_than
nothing_to
novel
novels
now
nowhere
nudity
obnoxious
obvious
obviously
odd
odyssey
off
offensive
offer
offers
often
oh
ok
okay
old
olds
on_dvd
on_earth
on_edge_seat
on_fire
on_imdb
on_on
once
once_again
ones
only
only_complaint
only_good
only_positive
only_problem
only_reason
only_reason_to
only_saving
only_thing
open_mind
opening
opinion
or
or_even
or_funny
or_hate
or_not
or_something
or_worse
order
ordinary
original
original_movie
oscar
other
others
otherwise
out
out_10
out_5
out_there
out_to
outer_space
outside
outstanding
over
over_top
overall
overall_good
own
pace
paced
packed
paid
painful
paint
paper
parents
paris
part
part_movie
particularly
parts
party
pass
pathetic
pay_attention
people
people_who
perfect
perfect_example
perfection
perfectly
performance
performance_as
performances
perhaps
perry
person
physical
picture
pile
place
plan_9
play
played
playing
plays
pleasant
pleasantly
pleasantly_surprised
please
pleased
pleasure
plenty
plods
plot
plots
plus
point
pointless
police
poor
poorly
porn
portrayal
potential
powell
power
powerful
predictable
predictable_but
premise
present
pretentious
pretty
pretty_bad
pretty_funny
pretty_good
prince
probably
problem
problem_with
producers
production
project
promising
propaganda
provoking
psycho
public
puerile
pull_off
pure
put
put_off
putting
quasi
questions
quickly
quite
rainy
ralph
raped
rare
rather
rating
ratio
raw
re
read
read_book
reading
real
real_life
real_people
realistic
reality
realizes
really
really_bad
really_good
reason
reason_to
reasonably
recently
recommend
recommended
redeeming
refreshing
refuses_to
relate_to
relationship
relax
release
released
remake
remarkable
remember
remember_seeing
reminds
remotely
rent
rented
repetitive
research
rest
result
revolting
rich
richard
rickman
ride
ridiculous
right
rip_off
riveting
robert
role
roles
room
rubbish
ruined
ruins
rules
run_around
running
s_ability
s_all
s_best
s_just
s_life
s_not
s_very
s_work
s_worth
sad
sadistic
sadly
said
said_that
same
same_time
satisfying
save
saved
saving
saw
saw_film
saw_movie
say
say_about
say_that
saying
says
scantily
scared
scariest
scene
scene_in
scenes
scenes_like
school
scientist
score
screaming
screen
screenplay
screenwriter
script
script_by
seagal
season
seasons
second
seconds
see
see_again
seeing
seem
seem_to
seemed
seems
seems_like
seems_to
seen
sees
segal
self
semi
sense
sensitive
sequel
sequence
sequences
series
seriously
set
sets
several
sex
sexy
shallow
shame_on
shameless
sharp
shelf
short
shot
shots
should
should_be
should_been
should_never
should_see
show
shown
shows
sick
side
silly
similar
simple
simplicity
simply
simply_not
sinatra
since
sisters
sit_back
sit_through
skill
skills
skip
sleep
sleeper
sleeve
slow
slow_but
slow_moving
small
snow
so
so_bad
so_disappointed
so_let
so_many
so_well
so_what
soap
social
society
solid
some
some_bad
some_good
some_guy
some_kind
some_things
someone
something
something_better
sometimes
somewhat
soon
sorry
sort
sound
soundtrack
space
special
special_effects
spectacular
speech
spend
spinal_tap
spit
splendid
spot_on
standard
star
stars
start
started
starts
starts_to
stay
stay_away
steals
steals_show
steer
stereotyped
stereotypes
stick_to
still
stilted
stinker
stock_footage
stop
story
story_just
story_told
storyline
strange
strength
strong
stunning
stupid
stupid_but
stupidest
stupidity
style
sub_par
subtitles
subtle
succeeds
success
such
such_as
sucked
sucked_into
sucks
superb
superbly
suppose
supposed
supposed_to
supposed_to_be
supposedly
sure
surface
surprise
surprised
surprising
surprisingly
surprisingly_good
sweet
synopsis
system
t_all
t_all_that
t_be
t_believe
t_care_about
t_disappoint
t_enough_to
t_even
t_even_know
t_forget
t_funny
t_know
t_let
t_like
t_make
t_matter
t_much
t_recommend
t_sure
t_think
t_very
t_want
t_work
take
take_in
takes
tale
talking
taped
taste
tear
tears
tedious
tell
tells
tense
terrible
terrific
than
than_any
than_expected
than_many
than_movie
than_watching
thank
thanks
that_being
that_but
that_does
that_film
that_funny
that_interesting
that_most
that_s
that_s_about
that_should_be
that_there
that_would
theater
them
themselves
then
then_again
then_will
there
there_just
there_no
there_s
there_some
there_some_good
these
these_people
thin
thing
things
think
think_about
thinking
third
third_rate
those
those_who
though
thought
thought_provoking
thought_that
three
through
throughout
thrown
thumbs
thumbs_down
thumbs_up
tight
time
time_in
time_watch
timeless
times
timing
tired
tiresome
title
to_all
to_avoid
to_be
to_be_good
to_believe
to_buy
to_come
to_cover
to_day
to_do
to_do_with
to_film
to_find
to_get
to_go
to_kill
to_know
to_make
to_original
to_recommend
to_save
to_say
to_see
to_see_again
to_show
to_sit_through
to_some
to_think
to_use
to_watch
to_work_with
to_write
today
todd
together
told
tolerable
too
too_hard
too_hard_to
too_many
too_much
too_seriously
took
top
top_notch
total
totally
touched
touches
touching
town
tragic
trash
travesty
treat
tried
tries_to_be
tripe
trite
troubled
true
truly
truth
try
trying
trying_to
turd
turkey
turkish
turned
turned_out
turning
tv
twists
two
two_hours
type
typical
ugly
ultimate
unbearable
unbelievable
unconvincing
underrated
understand
unexpected
unexplained
unforgettable
unfortunately
unfunny
uninspired
unintentional
unintentionally
unintentionally_hilarious
uninteresting
unique
unless
unlike
unlikeable
unnecessary
unpleasant
unrealistic
unremarkable
until
unusual
unwatchable
up
up_in
up_to
up_with
upon
use
used
useless
utter
value
van
vanessa
vapid
ve
ve_been
vehicle
version
very
very_bad
very_disappointed
very_enjoyable
very_entertaining
very_funny
very_good
very_little
very_moving
very_much
very_slow
very_strong
very_well
vhs
victims
video
view
viewer
viewing
viewings
violence
voice
voices
walked_out
walking_around
wall
want
want_to
wanted
wanted_to
wanted_to_like
wanting_more
wants
war
war_that
warm
wasn_t
waste
waste_time
wasted
wasting
watch
watch_over
watch_something
watchable
watched
watching
watson
way
way_that
way_to
way_too
wayans
ways
weak
wearing
webb
well
well_as
well_done
well_thought
well_worth
well_written
went
western
what
what_had
what_little
what_makes
what_may
what_point
what_thinking
whatsoever
when
where
where_going
whether
which
which_not
while
white
who
who_likes
whole
whole_movie
why
why_do
wife
will
will_be
will_definitely
will_not
with_little
with_two
without
without_being
woman
women
won
won_t
won_t_be
wonder
wonderful
wonderful_film
wonderfully
wooden
word
work
work_art
work_in
works
world
worlds
worse
worst
worst_film
worst_movie
worst_movies
worth
worthless
would
would_be
would_been
would_like_to
would_love_to
would_ve_been
wouldn_t
wrenching
write
writer
writers
writing
written
wrong
wrote
yawn
year
year_old
years
yes
yet
young
zombie
